Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་དང་། སྤྲུལ་པའི་སྐུས་ནི་འཁོར་རྣམས་ལ་ཆོས་ཀྱི་སྐུའི་གཟུགས་བརྙན་སྟོན་པར་སྨོན་ལམ་གྱི་དབང་གིས་སྐུ་དེ་གཉིས་སྣང་སྟེ།
en: “In the same way, noble one, through the power of prayers both the enjoyment and the emanation bodies manifest the reflections of the Dharma body to followers.

source: མཚན་མ་སྣ་ཚོགས་སུ་སྣང་ཡང་ཆོས་ཀྱི་སྐུའི་གནས་ལ་ནི་མཚན་ཉིད་ཐ་དད་པ་མེད་དོ། །
en: Even though they appear with a variety of characteristics, there are no different characteristics in the state of the Dharma body.

source: རིགས་ཀྱི་བུ་སྐུ་དེ་གཉིས་ལ་གནས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཕུང་པོ་ལྷག་མ་དང་བཅས་པའི་མྱ་ངན་ལས་འདས་པ་ཞེས་གསུང་ངོ་། །
en: “Noble one, in those two bodies the buddha bhagavats have what is called nirvāṇa with residual bodies.

source: ཆོས་ཀྱི་སྐུ་ལས་དགོངས་ཏེ། ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པ་ཞེས་གསུང་ངོ་། །
en: It is in relation to the Dharma body that the term nirvāṇa without a residual body is used.

source: དེར་ནི་ཆོས་ཐམས་ཅད་ཟད་པའི་མཐར་གྱུར་པའི་ཕྱིར་སྐུ་འདི་གསུམ་ལ་བརྟེན་ནས།
en: It is because the Dharma body is the final cessation of all phenomena.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་ལ་གནས་པ་ཞེས་བཤད་དོ། །
en: It is taught that the buddha bhagavats remain in nirvāṇa without location because of the totality of the three bodies.

source: སྐུ་གཉིས་ལ་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་མི་གསུང་སྟེ། ཆོས་ཀྱི་སྐུ་ལས་གཞན་པའི་སངས་རྒྱས་མེད་པའི་ཕྱིར་རོ། །
en: “Because there is no buddhahood other than the Dharma body, it is taught that the two other bodies are not nirvāṇa.

source: ཅིའི་ཕྱིར་སྐུ་གཉིས་པོ་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་མི་བྱ་ཞེ་ན།
en: Why are the two bodies said not to be nirvāṇa?

source: སྐུ་དེ་གཉིས་ནི་ཡང་དག་པ་མ་ཡིན་པ་བཏགས་པ་ཙམ་པས།
en: Those two bodies have no true validity; they are merely designations.

source: སྐད་ཅིག་ཏུ་སྐྱེ་ཞིང་འགག་པ་རྟག་པར་མི་གནས་པ་དང་།
en: They arise and cease with each instant and are not constantly present.

source: ཡང་དང་ཡང་དུ་འབྱུང་བས་མ་ངེས་པ་ལྟར་ཆོས་ཀྱི་སྐུ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།། །།
en: Because they arise again and again, they are not definitive. That is not what the Dharma body is like.

source: བམ་པོ་གཉིས་པ། །དེའི་ཕྱིར་སྐུ་དེ་གཉིས་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་མི་བྱའོ། །
en: “Therefore, those two bodies are not nirvāṇa.

source: ཆོས་ཀྱི་སྐུ་ཡང་དེ་དང་མི་གཉིས་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ལ་གནས་པ་མ་ཡིན་པས།
en: The Dharma body is also not located within nirvāṇa because the Dharma body and those two bodies are not dual.

source: སྐུ་དེ་གསུམ་ལ་བརྟེན་ཏེ། མི་གནས་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་གསུང་ངོ་། །
en: Therefore, because of these three bodies it is taught that there is nirvāṇa without location.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་མཚན་ཉིད་གསུམ་གྱི་ཕྱིར་འཆིང་བ་དང་། སྒྲིབ་པ་ཡོད་པས་སྐུ་གསུམ་ལས་རིང་དུ་གྱུར་ཏོ། །
en: “Noble one, foolish ordinary beings are in bondage and have obscurations because of three characteristics and as a result are far from the three bodies.

source: ཀུན་བརྟགས་པའི་མཚན་ཉིད་དང་། གཞན་གྱི་དབང་གི་མཚན་ཉིད་དང་། ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དོ། །
en: They are the characteristic of the imputed, the characteristic of the dependent, and the characteristic of the ultimately real.

source: མཚན་ཉིད་དེ་རྣམས་ཤེས་པ་དང་། འགོག་པ་དང་། དག་པར་མ་གྱུར་པ་དེའི་ཕྱིར་སྐུ་གསུམ་མ་ཐོབ་བོ། །
en: As long as those characteristics are not understood, have not ceased, and are not purified, the three bodies are not attained.

source: དེ་ལྟ་བུའི་མཚན་ཉིད་གསུམ་ཤེས་པ་དང་། འགོག་པ་དང་རྣམ་པར་བྱང་བར་གྱུར་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སྐུ་གསུམ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །
en: When those characteristics are understood, cease, and are purified, the buddha bhagavats have all three bodies.

source: རིགས་ཀྱི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས། རྣམ་པར་ཤེས་པ་གསུམ་མ་སྤངས་པའི་ཕྱིར་སྐུ་གསུམ་ལས་རིང་དུ་གྱུར་ཏོ། །
en: “Noble one, foolish ordinary beings are far from the three bodies because they have not freed themselves from the three consciousnesses.

source: དངོས་པོ་ལ་འཇུག་པའི་རྣམ་པར་ཤེས་པ་དང་། ཀུན་གཞི་ལ་གནས་པའི་ཡིད་དང་། ཀུན་གཞི་རྣམ་པར་ཤེས་པའོ། །
en: They are the consciousness that engages with things, the mentation that resides on the basis, and the basis consciousness.

source: ལམ་སྦྱོང་བ་དག་ལ་གནས་པས་འཇུག་པའི་རྣམ་པར་ཤེས་པ་སྦྱོང་ངོ་། །
en: Through following the path of purification, the engaging consciousness is purified.

source: གཅོད་པའི་ལམ་ལ་གནས་པས། ཀུན་གཞི་ལ་གནས་པའི་ཡིད་སྦྱོང་ངོ་། །
en: Through following the path of elimination, the mentation that resides on the basis is purified.

source: མཆོག་ཏུ་རྒྱལ་བའི་ལམ་ལ་གནས་པས། ཀུན་གཞིའི་རྣམ་པར་ཤེས་པ་སྦྱངས་སོ། །
en: Through the path of supreme victory, the basis consciousness is purified.

source: འཇུག་པའི་རྣམ་པར་ཤེས་པ་སྦྱངས་ན། སྤྲུལ་པའི་སྐུ་མངོན་དུ་འགྱུར་རོ། །
en: When the engaging consciousness is purified, the emanation body is manifested.

source: ཀུན་གཞི་ལ་གནས་པའི་ཡིད་སྦྱངས་པས་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་སྟོན་ཏོ། །
en: When the mentation that resides on the basis is purified, the enjoyment body is manifested.

source: ཀུན་གཞིའི་རྣམ་པར་ཤེས་པ་སྦྱངས་པས་ནི། ཆོས་ཀྱི་སྐུ་འཐོབ་སྟེ།
en: When the basis consciousness is purified, the Dharma body is attained.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐུ་གསུམ་ལྷུན་གྱིས་གྲུབ་པ་ཞེས་བྱའོ། །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྲུལ་པའི་སྐུ་ནི་སངས་རྒྱས་ཐམས་ཅད་དང་། སྤྱོད་པ་མཐུན་པའོ། །
en: In that way, there is what is called the spontaneous accomplishment of the three bodies by all the tathāgatas.

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་སངས་རྒྱས་ཐམས་ཅད་དང་དགོངས་པ་མཐུན་པའོ། །ཆོས་ཀྱི་སྐུ་ནི་སངས་རྒྱས་ཐམས་ཅད་དང་སྐུ་མཐུན་པའོ། །
en: “Noble one, the emanation bodies of all buddhas have the same buddha conduct, the enjoyment bodies of all the buddhas have the same intention, and the Dharma body of all the buddhas is the same body.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་སྤྲུལ་པའི་སྐུ་ནི་སྐྱེ་བོ་སོ་སོའི་ཡིད་དང་མཐུན་པར་རྣམ་པ་མང་པོས་མཚན་མ་སྣ་ཚོགས་སྟོན་པའི་ཕྱིར་མང་པོ་ཞེས་བྱའོ། །
en: “Noble one, because the emanation body manifests various characteristics in various forms in accord with the minds of ordinary beings, it is said to be multiple.

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་འཁོར་རྣམས་ཀྱི་བསམ་པ་གཅིག་པས། མཚན་ཉིད་གཅིག་པའི་ཕྱིར་མཚན་ཉིད་གཅིག་ཅེས་བྱའོ། །
en: Because the enjoyment body has a single characteristic and because its assemblies have a single aspiration, it is said to be possessing a single characteristic.

source: ཆོས་ཀྱི་སྐུ་ནི་མཚན་མ་སྣ་ཚོགས་ལས་ཡང་དག་པར་འདས་པ། མཚན་མར་གཟུང་བའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་སྟེ། དེ་བས་ན་གཅིག་པ་ཡང་མ་ཡིན། ཐ་དད་པ་ཡང་མ་ཡིན་པ་ཞེས་བྱའོ། །
en: Because the Dharma body has transcended the variety of characteristics and is not within the field of experience of those who perceive characteristics, it is said to be neither single nor diverse.

source: རིགས་ཀྱི་བུ། སྤྲུལ་པའི་སྐུ་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ལ་བརྟེན་ཏེ་མངོན་པར་སྣང་ངོ་། །
en: “Noble one, the emanation body appears on the basis of the enjoyment body.

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ་ལ་བརྟེན་ཏེ་མངོན་པར་སྣང་ངོ་། །
en: The enjoyment body appears on the basis of the Dharma body.

source: ཆོས་ཀྱི་སྐུ་ནི་ཡང་དག་པ་སྟེ། ཅི་ལ་ཡང་མི་གནས་པའོ། །
en: The Dharma body is true and is not based on anything.

source: རིགས་ཀྱི་བུ་སྐུ་དེ་གསུམ་ནི་རྟག་པར་བཤད་པའི་རྣམ་གྲངས་ཀྱང་ཡོད། མི་རྟག་པར་བཤད་པའི་རྣམ་གྲངས་ཀྱང་ཡོད་དོ། །
en: “Noble one, there is a classification that teaches that those three bodies are permanent, and there is a classification that teaches that they are impermanent.

source: སྤྲུལ་པའི་སྐུ་ནི་ཐབས་མཁས་པས་རྣམ་པ་ཐམས་ཅད་དུ་དམིགས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱུན་མི་འཆད་པར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཕྱིར་རྟག་པ་ཞེས་བྱའོ། །
en: “The emanation body is said to be permanent because, through skillful methods in all forms, in accordance with perceptions, it continuously turns the wheel of the Dharma.

source: དེ་གཞིར་མ་གྱུར་པས་མཛད་པ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་མངོན་དུ་མི་སྟོན་པའི་ཕྱིར་མི་རྟག་པ་ཞེས་བྱའོ། །
en: It is said to be impermanent because, as it is not the basis, the perfection of great deeds does not manifest.

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ནི་ཐོག་མ་མེད་པའི་དུས་ནས་རྒྱུན་མི་འཆད་ཅིང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་མ་འདྲེས་པས་ཡོངས་སུ་འཛིན་ཅིང་སྡུད་པའི་ཕྱིར། སེམས་ཅན་ཟད་པ་མེད་པས།
en: “The enjoyment body is said to be permanent because throughout beginningless time it has the accumulation and possession of the unique qualities of the buddhas, and there is no end to its conduct because there is no end to beings.

source: སྤྱོད་པ་ཡང་མི་ཟད་དེ། དེའི་ཕྱིར་རྟག་པ་ཞེས་བྱའོ། །དེ་ཡང་གཞིར་མ་གྱུར་པའི་ཕྱིར་མཛད་པ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་མངོན་དུ་མི་སྟོན་པས་མི་རྟག་པ་ཞེས་བྱའོ། །
en: It is said to be impermanent because, as it is not the basis, the perfection of great deeds does not manifest.

source: ཆོས་ཀྱི་སྐུ་ནི་འདུ་བྱེད་ཀྱི་ཆོས་མ་ཡིན་པ་མཚན་མ་ཐ་དད་པ་མེད་པ་རྩ་བ་དང་གཞིར་གྱུར་པའི་ཕྱིར། ནམ་མཁའ་ཇི་ལྟ་བ་བཞིན་པས་དེ་ནི་རྟག་པ་ཞེས་བྱའོ། །
en: “The Dharma body is said to be permanent because it is not a composite phenomenon, it does not have diverse characteristics, it is the root and basis, and it is like space.

source: རིགས་ཀྱི་བུ་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ལས་གུད་ན་འཕགས་པའི་ཡེ་ཤེས་མེད་དོ། །
en: “Noble one, there is no other wisdom that is superior to nonconceptual wisdom.

source: དེ་བཞིན་ཉིད་ཀྱི་ཆོས་ཉིད་ལས་ཀྱང་ལྷག་པའི་སྤྱོད་ཡུལ་མེད་དོ། །དེ་ནི་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་།
en: There is no field of activity that is superior to that of the true nature of phenomena.

source: ཡེ་ཤེས་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་དེ་གཉིས་ཀྱི་དེ་བཞིན་ཉིད་ནི་གཅིག་པ་ཡང་མ་ཡིན་ཐ་དད་པ་ཡང་མ་ཡིན་པས་དེའི་ཕྱིར་ཆོས་ཀྱི་སྐུ་ནི་ཡེ་ཤེས་རྣམ་པར་དག་པ་དང་།
en: There is the true nature of phenomena and the true nature of wisdom, and the true nature of those two true natures is not one and not different.

source: སྤངས་པ་རྣམ་པར་དག་པ་གཉིས་ཀྱི་ཕྱིར། ཆོས་ཀྱི་སྐུ་ནི་རྣམ་པར་དག་པ་ཕུན་སུམ་ཚོགས་པ་ཞེས་བྱའོ། །
en: Therefore, the Dharma body is pure wisdom and pure elimination, and because of those two, the Dharma body is the perfection of purity.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་སྐུ་འདི་གསུམ་དབྱེ་བ་ལ་ཡང་རྣམ་པ་བཞི་སྟེ། སྤྲུལ་པའི་སྐུ་ཡིན་ལ། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་མ་ཡིན་པ་ཡང་ཡོད། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡིན་ལ། སྤྲུལ་པའི་སྐུ་མ་ཡིན་པ་ཡང་ཡོད། སྤྲུལ་པའི་སྐུ་ཡིན་ལ། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡིན་པ་ཡང་ཡོད།
en: “Moreover, noble one, there are four ways to categorize these three bodies: that which is the emanation body but not the enjoyment body; that which is the enjoyment body but not the emanation body; that which is both the emanation body and the enjoyment body; and that which is neither the emanation body nor the enjoyment body.

source: སྤྲུལ་པའི་སྐུ་ཡང་མ་ཡིན་ལ། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་མ་ཡིན་པའོ། །སྤྲུལ་པའི་སྐུ་ཡིན་ལ། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་མ་ཡིན་པ་གང་ཞེ་ན།
en: “What is the emanation body but not the enjoyment body?

source: དེ་བཞིན་གཤེགས་པ་རྣམས་མྱ་ངན་ལས་འདས་སུ་ཟིན་ཀྱང་། སྨོན་ལམ་གྱི་དབང་གིས་སྐལ་བ་ཇི་ལྟ་བ་བཞིན་ཕན་འདོགས་པ་ནི་སྤྲུལ་པའི་སྐུ་ཞེས་བྱའོ། །
en: The emanation body is when the tathāgatas, even though they have passed into nirvāṇa, through the power of their prayers benefit beings in accordance with their worthiness.

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡིན་ལ། སྤྲུལ་པའི་སྐུ་མ་ཡིན་པ་གང་ཞེ་ན།
en: “What is the enjoyment body and not the emanation body?

source: སའི་སྔ་རོལ་པའི་སྐུའོ། །
en: That is a body that is seen on the bhūmis.

source: སྤྲུལ་པའི་སྐུ་ཡང་ཡིན་ལ། ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་ཡིན་པ་དེ་གང་ཞེ་ན།
en: “What is both the emanation body and the enjoyment body?

source: ལྷག་མ་དང་བཅས་པའི་མྱ་ངན་ལས་འདས་པའི་སྐུའོ། །
en: That is the body of nirvāṇa with a residue.

source: སྤྲུལ་པའི་སྐུ་ཡང་མ་ཡིན་ལ།
en: “What is neither the emanation body nor the enjoyment body?

source: ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ཡང་མ་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུའོ། །
en: That is the Dharma body.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་སྐུ་དེ་ནི་ཆོས་གཉིས་སུ་མེད་པ་མངོན་དུ་གྱུར་པའོ། །གཉིས་གང་ཞེ་ན། ཆོས་ཀྱི་སྐུ་དེ་ལ་མཚན་ཉིད་དང་། མཚན་ཉིད་ཀྱི་གཞི་གཉི་ག་མེད་པ་སྟེ། ཡོད་པ་ཡང་མ་ཡིན།
en: “Noble one, the Dharma body is the direct perception of the nonduality of phenomena.

source: མེད་པ་ཡང་མ་ཡིན། གཅིག་པ་ཡང་མ་ཡིན།
en: What is nonduality?

source: ཐ་དད་པ་ཡང་མ་ཡིན། བགྲང་བ་ཡང་མ་ཡིན། བགྲང་བར་མི་བྱ་བ་ཡང་མ་ཡིན། སྣང་བ་ཡང་མ་ཡིན། མུན་པ་ཡང་མ་ཡིན་པ་སྟེ།
en: In the Dharma body, there are no characteristics, nor any basis for characteristics; there is no existence and there is no nonexistence; there is no singularity and no differences; there is no number and there is nothing to be enumerated; and there is no light and there is no darkness.

source: དེ་ལྟ་བུའི་དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཚན་ཉིད་དང་། མཚན་ཉིད་ཀྱི་གཞིར་ཡང་མི་དམིགས། ཡོད་པ་དང་མེད་པར་ཡང་མི་དམིགས། གཅིག་པ་དང་ཐ་དད་པར་ཡང་མི་དམིགས། བགྲང་བར་ཡང་མི་དམིགས། བགྲང་བར་མི་བྱ་བར་ཡང་མི་དམིགས།
en: “In that way, in the wisdom of the true nature there is no perception of characteristics or any basis for characteristics; there is no perception of existence or nonexistence; there is no perception of singularity or differences; there is no perception of number or absence of number; and there is no perception of light or darkness.

source: སྣང་བ་དང་མུན་པར་ཡང་མི་དམིགས་པ་སྟེ། འདི་ལྟར་སྤྱོད་ཡུལ་རྣམ་པར་དག་པ་དང་། ཡེ་ཤེས་རྣམ་པར་དག་པ་དེ་དབྱེར་མེད་པ། བར་མཚམས་མེད་པ་འགོག་པ་དང་ལམ་གྱི་གཞིར་གྱུར་པ་སྟེ།
en: “In that way there is an inseparability of the pure field of activity and pure wisdom, there is no gap between them, and they are the basis of cessation and the path.

source: དེའི་ཕྱིར་ན་ཆོས་ཀྱི་སྐུ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་སྣ་ཚོགས་མངོན་དུ་གྱུར་པའོ། །
en: Therefore, a Dharma body manifests the various deeds of a tathāgata.

source: རིགས་ཀྱི་བུ་སྐུ་འདི་ནི་རྒྱུ་དང་རྐྱེན་དང་སྤྱོད་ཡུལ་དང་། གནས་དང་འབྲས་བུ་དག་གཞི་ཉིད་ལ་བརྟེན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ།
en: “Noble one, the cause, condition, field of activity, location, and result and basis of this body are impossible to calculate.

source: དོན་དེ་མངོན་པར་ཤེས་ན། སྐུ་དེ་ཉིད་ཐེག་པ་ཆེན་པོའོ། །
en: If that meaning is known, that body is the Mahāyāna.

source: དེ་ཉིད་དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་དོ། །
en: That is the nature of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་སྟེ། སྐུ་དེ་ལ་བརྟེན་ནས། སེམས་དང་པོ་སྐྱེད་པ་དང་། ས་ཡོངས་སུ་སྦྱངས་པའི་སེམས་མངོན་པར་འབྱུང་སྟེ།
en: That is the essence of the tathāgatas.

source: ས་ལས་ཕྱིར་མི་ལྡོག་པའི་སེམས་ཀྱང་མངོན་དུ་འགྱུར་བ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ལ་གནས་པའི་སེམས་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། དེ་བཞིན་གཤེགས་པའི་དགོངས་པ་ཡང་མངོན་པར་འབྱུང་། དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ཚད་མེད་གྲངས་མེད་པ་ཐམས་ཅད་ཀྱང་མངོན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: On the basis of that body, there is the first development of aspiration, there is the arising of the mind that trains on the bhūmis, and there is the manifestation of the mind that does not regress, the mind that has one life remaining, the arising of the vajra-like samādhi, the view of the tathāgatas, and the arising of all the countless, innumerable Dharma teachings of the tathāgatas.

source: ཆོས་ཀྱི་སྐུ་ལ་བརྟེན་ནས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་ཡང་མངོན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: On the basis of the Dharma body there is also the arising of countless great samādhis.

source: ཆོས་ཀྱི་སྐུ་འདི་ལ་བརྟེན་ནས་ཡེ་ཤེས་ཆེན་པོ་ཐམས་ཅད་ཀྱང་སྣང་བར་འགྱུར་རོ། །
en: Also, all great wisdom arises on the basis of this Dharma body.

source: དེ་ལྟ་བས་ན་སྐུ་གཉིས་ནི་ཏིང་ངེ་འཛིན་དང་ཡེ་ཤེས་ལ་བརྟེན་ནས་འབྱུང་བར་འགྱུར་རོ། །
en: Therefore, the two bodies arise on the basis of samādhi and wisdom.

source: ཆོས་ཀྱི་སྐུ་འདི་ནི་རང་གི་ངོ་བོ་ཉིད་ལ་བརྟེན་པས་རྟག་པ་ཞེས་བྱའོ། །
en: This Dharma body, because it depends upon its own nature, is called eternal.

source: བདག་ཅེས་བྱའོ། །
en: It is called self.

source: ཏིང་ངེ་འཛིན་ཆེན་པོ་ལ་བརྟེན་པས་ན་བདེ་བ་ཞེས་བྱའོ། །
en: As it depends upon great samādhi, it is called bliss.

source: ཡེ་ཤེས་ཆེན་པོ་ལ་བརྟེན་པས་ན་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ།
en: As it depends upon great wisdom, it is called purity.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྟག་པར་བདེ་བ་དང་། རྣམ་པར་དག་པ་ལ་མངའ་བརྙེས་ཤིང་བཞུགས་པའོ། །ཏིང་ངེ་འཛིན་ཆེན་པོ་ལ་བརྟེན་ནས། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་སོགས་པའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ། དྲན་པ་ཉེ་བར་གཞག་པ་ཐམས་ཅད་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: Therefore, a tathāgata has attained and always remains in bliss and purity.

source: སྙིང་རྗེ་ཆེན་པོ་དང་། གཟུངས་ཐམས་ཅད་དང་། མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་། དབང་ཐམས་ཅད་དང་། མཉམ་པ་ཉིད་ཀྱི་ཆོས་ཐམས་ཅད་འཛིན་པ་ལ་སོགས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་འབྱུང་ངོ་། །
en: “On the basis of great samādhi there manifest all samādhis, such as the heroic samādhi; all mindfulnesses such as the mindfulness of phenomena; and all the qualities of the buddhas, such as great love, great compassion, all retentions, all higher cognitions, all powers, and the possession of all the qualities of equality.

source: ཡེ་ཤེས་ཆེན་པོ་ལ་བརྟེན་པས་ནི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ལ་སོགས་པ་མ་འདྲེས་པའི་ཆོས་བརྒྱ་བརྒྱད་ཅུ་དང་། རྨད་དུ་བྱུང་བ་ཐམས་ཅད་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་ཐམས་ཅད་མངོན་དུ་འགྱུར་རོ། །
en: “On the basis of great wisdom there manifest the hundred and eighty unique qualities, such as the ten strengths, the four fearlessnesses, the four discernments, and so on—all the wonders, and all inconceivable qualities.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ལ་བརྟེན་ནས་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་གྲངས་མེད་པ་ཐམས་ཅད་སྣང་བར་འགྱུར་རོ། །
en: “As an analogy, on the basis of a precious wish-fulfilling jewel appear all the countless, innumerable jewels of various kinds.

source: དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་ཆེན་པོའི་རིན་པོ་ཆེ་དང་ཡེ་ཤེས་ཆེན་པོའི་རིན་པོ་ཆེ་ལ་བརྟེན་པས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དམ་པའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་གྲངས་མེད་པ་མངོན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: In a similar way, on the basis of the great samādhi and great wisdom manifest various countless, innumerable sublime qualities of all the buddhas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་ཆོས་ཀྱི་སྐུ་དང་། ཏིང་ངེ་འཛིན་དང་། ཡེ་ཤེས་ནི་མཚན་མ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། མཚན་མས་མི་གོས་པ། རྣམ་པར་མི་རྟོག་པ།
en: “Noble one, in that way the Dharma body, samādhi, and wisdom transcend all characteristics, are unstained by characteristics, are nonconceptual, and are neither eternal nor destructible.

source: རྟག་པའང་མ་ཡིན། ཆད་པའང་མ་ཡིན་པ་སྟེ། དེ་ནི་དབུ་མའི་ལམ་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is called the accomplishment of the path of the Middle Way.

source: རྣམ་པར་རྟོག་པ་ཡོད་པར་སྣང་ཡང་། ངོ་བོ་ཉིད་ལ་ནི་རྣམ་པར་རྟོག་པ་ཡང་མེད།
en: Although the Dharma body appears to have thoughts, in essence it is without thought.

source: གསུམ་དུ་བགྲང་བ་ཡང་ཡོད་མོད་ཀྱི། དངོས་པོ་གསུམ་དུའང་མེད་དོ། །
en: Although there is a threefold enumeration, there are no three entities.

source: འཕེལ་བ་དང་འགྲིབ་པ་མེད་པ་དེ་ནི་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུ་སྟེ། གཟུང་བ་ཡང་མེད། འཛིན་པ་ཡང་མེད་དོ། །
en: There is no increase or diminution. It is like an illusion or a dream; there is no object and no subject.

source: ཆོས་ཀྱི་ངོ་བོའི་དེ་བཞིན་ཉིད་ནི་རྣམ་པར་གྲོལ་བའི་གནས་ཏེ།
en: The true nature, the essence of the Dharma, is the basis of liberation.

source: འཆི་བདག་གི་སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདས་པ།
en: It completely transcends Yama’s scope of activity.

source: འཁོར་བའི་མུན་པ་ལས་མངོན་དུ་རྒལ་བ།
en: It has crossed over the darkness of saṃsāra.

source: སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་བསྒྲུབ་པར་མི་ནུས་པ། མཐར་ཕྱིན་པར་མི་ནུས་པ།
en: All beings are unable to accomplish it, unable to reach it.

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བཞུགས་པར་བྱ་བའི་གནས་སོ། །
en: It is the state for all buddhas and bodhisattvas to dwell in.

source: རིགས་ཀྱི་བུ་དཔེར་ན། གང་ལ་ལ་ཞིག་གསེར་འདོད་དེ། གནས་ཀུན་དུ་བཙལ་བ་ལས་གསེར་གྱི་སྦྲམ་བུ་རྙེད་ནས་སྦྲམ་བུ་དེ་ཞིབ་ཏུ་བཏགས་ཏེ། སྙིང་པོ་བཞུ་ཞིང་སྦྱངས་ནས་རྣམ་པར་བྱང་བར་གྱུར་པ་དང་།
en: “As an analogy, noble one, if someone who wanted gold searched for it and found a nugget of gold, he would grind it, extract the essence, smelt it, and purify it so that it became pure.

source: གསེར་དེ་གདུ་བུ་ལ་སོགས་པ། རྒྱན་རྣམ་པ་སྣ་ཚོགས་པ་ཡིད་བཞིན་དུ་བསྒྱུར་ཏེ། སྤྱད་ཀྱང་གསེར་གྱི་རང་བཞིན་ཉིད་ནི་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ།
en: Then he would make it into various kinds of jewelry, such as gold rings, but the nature of the gold would never change.

source: རིགས་ཀྱི་བུ་མོ་གང་འཇིག་རྟེན་གྱི་དགེ་བར་སྤྱོད་པར་མོས་པ་དེས། དེ་བཞིན་གཤེགས་པའམ། དེ་བཞིན་གཤེགས་པའི་འཁོར་དེ་དག་མཐོང་སྟེ། ཉེ་བར་བསྙེན་ནས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་བ་ནི་གང་།
en: “Also, noble one, if any noble men or noble women who wished to practice worldly good actions saw a tathāgata and the tathāgata’s assembly, they would approach and they would say, ‘Bhagavat, what is a good action and what is a bad action?

source: མི་དགེ་བ་ནི་གང་། ཡང་དག་པའི་བསྒྲུབ་པ་གང་བགྱིས་པས། རྣམ་པར་དག་པའི་སྤྱོད་པ་ཐོབ་པར་འགྱུར།
en: What is true accomplishment through which one attains pure conduct?’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། དེའི་འཁོར་དག་གིས་དེ་སྐད་ཅེས་འདྲི་བ་ལ་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: They would ask such questions of that buddha bhagavat and his assembly.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་འདི་དག་ནི། དམ་པའི་ཆོས་ཉན་པར་མོས་པ་དང་། རྣམ་པར་བྱང་བར་འདོད་པ་སྟེ། འདི་དག་ལ་ཡང་དག་པའི་ཆོས་བསྟན་ཏོ་སྙམ་མོ། །
en: Then they would think, ‘These noble men and noble women aspire to hear the Dharma, they wish for purification, so I will teach them the Dharma.’

source: དེ་ཐོས་ནས་ཀྱང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་སྟེ། ནན་ཏན་གྱིས་བསམ་པ་སྐྱེས་ཤིང་། བརྩོན་པར་གྱུར་པའི་མཐུས། ལེ་ལོའི་སྒྲིབ་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་བསལ་ཏེ།
en: “Then, when they heard it, and remembered it correctly, they would develop a determined motivation, and through the power of their diligence they would dispel the obscuration of idleness and all sinful, bad qualities.

source: བསླབ་པའི་གནས་ཐམས་ཅད་ལ་རབ་ཏུ་གུས་པར་གནས་ཤིང་། སེམས་བྱིང་བ་དང་།
en: They would follow with reverence all the fields of training and dispel all dullness and agitation of the mind.

source: རྒོད་པ་དག་བསལ་ཏེ་ས་དང་པོ་ལ་འཇུག་གོ། །
en: Thereby they would enter the first bhūmi.

source: ས་དང་པོའི་སེམས་ལ་བརྟེན་ནས། སེམས་ཅན་མང་པོའི་དོན་ལ་བརྩོན་པ་ལ་སྒྲིབ་པ་སྤངས་པས། ས་གཉིས་པ་ལ་འཇུག་གོ། །
en: “Through the mind of the first bhūmi they would eliminate that which obscures being dedicated to benefiting many beings, and thereby they would enter the second bhūmi.

source: ས་དེ་ལས་ཉོན་མོངས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་གསུམ་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate obscuration by the kleśas, and thereby they would enter the third bhūmi.

source: ས་དེ་ལས་སེམས་རྣམ་པར་སྦྱོང་བ་ལ་སྒྲིབ་པ་སྤངས་ནས། ས་བཞི་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures purifying the mind, and thereby they would enter the fourth bhūmi.

source: ས་དེ་ལས་ཐབས་མཁས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་ལྔ་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures skillful methods, and thereby they would enter the fifth bhūmi.

source: ས་དེ་ལས་དོན་དམ་པ་དང་ཀུན་རྫོབ་ཏུ་དམིགས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་དྲུག་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures perceiving ultimate and relative truth, and thereby they would enter the sixth bhūmi.

source: ས་དེ་ལས་མཚན་མ་དང་སྤྱོད་པ་ལ་དམིགས་པའི་སྒྲིབ་པ་སྤངས་ནས། །ས་བདུན་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures perceiving characteristics and conduct, and thereby they would enter the seventh bhūmi.

source: ས་དེ་ལས་མཚན་མ་འགོག་པར་ཡང་མི་དམིགས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་བརྒྱད་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures the nonperception of the cessation of characteristics, and thereby they would enter the eighth bhūmi.

source: ས་དེ་ལས་མཚན་མ་སྐྱེ་བར་ཡང་མི་དམིགས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་དགུ་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures the nonperception of the arising of characteristics, and thereby they would enter the ninth bhūmi.

source: ས་དེ་ལས་དྲུག་པ་མངོན་པར་ཤེས་པའི་སྒྲིབ་པ་སྤངས་ནས། ས་བཅུ་པ་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures the six higher cognitions, and thereby they would enter the tenth bhūmi.

source: ས་དེ་ལས་ཤེས་བྱའི་སྒྲིབ་པ་དང་། ཀུན་གཞི་རྣམ་པར་ཤེས་པ་སྤངས་པས། དེ་བཞིན་གཤེགས་པའི་ས་ལ་འཇུག་གོ། །
en: On that bhūmi they would eliminate that which obscures knowledge, and thereby would eliminate the basis-consciousness and enter the bhūmi of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་ས་ནི་རྣམ་པར་དག་པ་གསུམ་གྱི་ཕྱིར། རབ་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱའོ། །
en: “Because the bhūmi of the tathāgatas has three purities it is called the perfectly pure.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those three?
